0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndback
    {
        type            empty;
    }
    interface
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    outlet
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        value           $internalField;
    }
    inlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        value           $internalField;
    }        
}

// ************************************************************************* //
