constant/analyticalRegionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dropletProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

originalPyrolsisLength        	[0 1 0 0 0 0 0] 0.03;
pyrolysisStartPosition			[0 1 0 0 0 0 0] 0.1;
assimilationActivation			false;
interface 						"interface";
initialBNumber					1;

// ************************************************************************* //
