constant/reactions
species
(
    O2
    H2O
    C7H16
    CO2
    N2
);

reactions
{
    propaneReaction
    {
        type         irreversibleinfiniteReaction;
        reaction     "C7H16 + 11O2 + 41.36N2 = 7CO2 + 8H2O + 41.36N2";
    }
}
