system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.08 0 0)
    (0.08 0.8 0)
    (0 0.8 0)
    (0 0 1)
    (0.08 0 1)
    (0.08 0.8 1)
    (0 0.8 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 200 1) simpleGrading (3 3 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    wall
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    interface
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    frontAndback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
